Tekla Open API Reference for Tekla Structures 2025
UserPropertyItem.SetDefaultValue Method (Double)
 Sets the default value of a double property.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SetDefaultValue(
	double DefaultValue
)
Public Function SetDefaultValue (
	DefaultValue As Double
) As Boolean
Parameters
DefaultValue
Type: System.Double
The new value.
Return Value
Type: Boolean
True on success.
See Also
Reference
UserPropertyItem Class
SetDefaultValue Overload
Tekla.Structures.Catalogs Namespace